.config/emacs/emacs.org
#+TITLE: Nimai's GNU Emacs configuration
#+AUTHOR: Nimai Patel
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table of Contents
:PROPERTIES:
:TOC:      :include all
:END:

:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#startup-tuning][Startup Tuning]]
  - [[#native-comp][Native Comp]]
  - [[#garbage-collection][Garbage Collection]]
  - [[#startup-time][Startup Time]]
- [[#package-management][Package Management]]
  - [[#setup-package-archives][Setup Package Archives]]
  - [[#use-package][use-package]]
- [[#ui-configuration][UI Configuration]]
  - [[#base16-colorschemes][Base16 Colorschemes]]
  - [[#fonts][Fonts]]
  - [[#hot-reload][Hot Reload]]
  - [[#which-key][Which Key]]
  - [[#icons][Icons]]
  - [[#mode-line][Mode Line]]
  - [[#rainbow-delimeters][Rainbow Delimeters]]
  - [[#colored-man-pages][Colored Man Pages]]
  - [[#frames-only][Frames Only]]
  - [[#other-ui-settings][Other UI Settings]]
    - [[#cursor][Cursor]]
    - [[#menu-bars][Menu Bars]]
    - [[#visible-bell][Visible Bell]]
    - [[#launch-buffer][Launch Buffer]]
    - [[#column-and-line-numbers][Column and Line Numbers]]
- [[#keybindings][Keybindings]]
  - [[#general][General]]
  - [[#evil-mode][Evil Mode]]
    - [[#evil-collection][Evil Collection]]
    - [[#argument-text-ojects][Argument Text Ojects]]
    - [[#surround][Surround]]
    - [[#highlight-on-yank-delete-et-cetera][Highlight on yank, delete, et cetera]]
    - [[#commenting][Commenting]]
  - [[#resize-windows][Resize Windows]]
  - [[#incremental-selection][Incremental Selection]]
- [[#wild-menu][Wild Menu]]
  - [[#ivy][Ivy]]
  - [[#counsel][Counsel]]
- [[#development][Development]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
  - [[#snippets][Snippets]]
  - [[#parentheses][Parentheses]]
  - [[#lsp][LSP]]
    - [[#lsp-ui][lsp-ui]]
    - [[#lsp-treemacs][lsp-treemacs]]
    - [[#lsp-ivy][lsp-ivy]]
  - [[#company][Company]]
  - [[#code-formatters][Code Formatters]]
  - [[#languages][Languages]]
    - [[#typescript-and-javascript][TypeScript and JavaScript]]
    - [[#haskell][Haskell]]
    - [[#dart-and-flutter][Dart and Flutter]]
    - [[#cc][C/C++]]
    - [[#python][Python]]
    - [[#shell][Shell]]
    - [[#html-and-css][HTML and CSS]]
- [[#org-mode][Org Mode]]
  - [[#bullets][Bullets]]
  - [[#center-org-mode-buffers][Center org-mode buffers]]
  - [[#evaluate-code][Evaluate Code]]
  - [[#literate-configuration][Literate Configuration]]
  - [[#structured-templates][Structured Templates]]
  - [[#automatically-make-toc][Automatically Make TOC]]
- [[#rss-feeds][RSS Feeds]]
- [[#shell-modes][Shell Modes]]
- [[#file-management][File Management]]
- [[#miscellaneous][Miscellaneous]]
  - [[#auto-rever-buffers][Auto Rever Buffers]]
  - [[#no-littering][No Littering]]
  - [[#helpful][Helpful]]
:END:

* Startup Tuning
** Native Comp

This configuration uses the native compilation + pure GTK build of Emacs. Specifically, I'm using [[https://aur.archlinux.org/packages/emacs-pgtk-native-comp-git/][this PKGBUILD from the AUR]]. The compiler warnings for all the packages are very annoying so I'm shutting them down.

#+begin_src emacs-lisp
(setq native-comp-async-report-warnings-errors nil)
#+end_src

** Garbage Collection

We reduce the frequency of garbage collection at launch to increase the startup time.

#+begin_src emacs-lisp
(setq gc-cons-threshold (* 50 1000 1000))
#+end_src

** Startup Time
   
We print the startup time and number of garbage collections to the =*Messages*= buffer.

#+begin_src emacs-lisp
(defun np/display-startup-time ()
  (message "emacs loaded in %s with %d garbage collections."
    (format "%.2f seconds" (float-time (time-subtract after-init-time before-init-time)))
      gcs-done))

(add-hook 'emacs-startup-hook #'np/display-startup-time)
#+end_src

* Package Management
** Setup Package Archives
   
Setup Emacs's builtin package manager, package.el, to work with melpa and org-mode archives. Standard GNU elpa repository has very few packages.

#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org"   . "https://orgmode.org/elpa/")
                         ("elpa"  . "https://elpa.gnu.org/packages/")))
#+end_src

Download packages using =package-refresh-contents= only if they are not available in local archives. We only need this for installing =use-package=.

#+begin_src emacs-lisp
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

** use-package

Set up the use-package macro which allows us to lazy-load elisp packages based on certain predicates.

#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
#+end_src

We also make sure it uses =:ensure t= for all packages -- unless specified otherwise -- to make sure we are downloading packages that we dont't have.

#+begin_src emacs-lisp
(setq use-package-always-ensure t)
#+end_src

* UI Configuration
** Base16 Colorschemes

The Base16 color scheme is generated using a mustache template and a color pallete. See the =change-mode= script in my dotfiles for more details.

We first write a function which gets the value of an Xresources variable by parsing the output of =xrdb -q=. The function only works if all your variables are of the form =*varname: value=.  The built-in =x-get-resource= function tokenizes the function call which makes it useless for our purposes.

#+begin_src emacs-lisp
(defun np/x-get-resource-live (name)
  "Read the name of a xresources variable from output of `xrdb -q`.
  This function doesn't cache old values like x-get-resource
  and instead searches the database again."
  (shell-command-to-string
(format "xrdb -q | grep '\*%s' | sed 's/^\*font://g ; s/^[ \t]*//;s/[ \t]*$//'" name)))
#+end_src

We also add the path where we will be saving the generated theme to ='custom-theme-load-path= so that Emacs can find it.

#+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path "~/.config/emacs/themes")
#+end_src

Then we write a function that refreshes our color scheme configuration so that we can use it to hot-reload these settings.

#+begin_src emacs-lisp
(defun np/set-colors ()
  "Load colors from generated theme"
  (interactive)
  (load-theme 'base16-generated t))
(np/set-colors)
#+end_src

** Fonts

We write a function to get just the font name from the output =xrdb -q=, parsing its output as before.

#+begin_src emacs-lisp
(defun np/get-x-font ()
  (shell-command-to-string
    "printf %s \"$(xrdb -q | grep '\*font:' | cut -d: -f2 | sed 's/^\t//g')\""))
#+end_src

We then write a function that sets all face attributes to the value that we get from =np/get-x-font= and then immediately call the function. This function will also be called when we want to hot-reload font settings from our script.

#+begin_src emacs-lisp
(defun np/set-font ()
  (setq np/x-font (np/get-x-font))
  (set-face-attribute 'default nil
                      :height 110
                      :font np/x-font)

  (set-face-attribute 'fixed-pitch nil
                      :height 110
                      :font np/x-font)

  (set-face-attribute 'variable-pitch nil
                      :height 110
                      :font np/x-font))
(np/set-font)
#+end_src

The fonts aren't set properly when using daemon mode, so we fix it by calling our =np/set-font= function after the frame is generated in =emacsclient=.

#+begin_src emacs-lisp
(if (daemonp)
  (add-hook 'after-make-frame-functions
    (lambda (frame)
      (with-selected-frame frame
        (np/set-font)))))
#+end_src

** Hot Reload

We call =np/set-colors= and =np/set-font= when =USR1= is passed to Emacs so we can reload font and color settings from our script.

#+begin_src emacs-lisp
(defun np/set-colors-and-font ()
  (interactive)
  (np/set-colors)
  (np/set-font))

(define-key special-event-map [sigusr1] 'np/set-colors-and-font)
#+end_src

** Which Key
   
whick-key provides us with a nice UI panel when we are performing key chords to show possible bindings that can complete the chord along with descriptions for them. This provides us with amazing discoverability.

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.3))
#+end_src

** Icons

We install the all-the-icons package for icons in the modeline, selection menus, et cetera for things like filetypes, modes and git branches. Remember to run =all-the-icons-install-fonts= when pulling this config and using it for the first time.
   
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

We configure ivy-rich and dired to use the icons.

#+begin_src emacs-lisp
(use-package all-the-icons-ivy-rich
  :init(all-the-icons-ivy-rich-mode))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
   
** Mode Line

Use the default default mode line from Doom Emacs and only reduce its height a little.

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode)
  :custom ((doom-modeline-height 15)))
#+end_src

** Rainbow Delimeters
   
This minor mode add colors to parentheses in programming modes.

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Colored Man Pages

Colorize man pages by setting face attributes. This is theme agnostic to work with above mentioned Base16.

#+begin_src emacs-lisp
(use-package man
  :config
  (set-face-attribute 'Man-overstrike nil :inherit font-lock-type-face :bold t)
  (set-face-attribute 'Man-underline nil :inherit font-lock-keyword-face :underline t))
#+end_src

** Frames Only

Only use frames When spawning new Emacs instances. This is used in conjunction with daemon mode and emacsclient. Using Emacs like this makes it play very well with tiling window managers like dwm and xmonad.

#+begin_src emacs-lisp
(use-package frames-only-mode
  :init (frames-only-mode))
#+end_src

** Other UI Settings

*** Cursor

Blink the cursor forever.

#+begin_src emacs-lisp
(setq blink-cursor-blinks 0)
#+end_src

*** Menu Bars

First we disable all graphical bar modes from the UI.

#+begin_src emacs-lisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
#+end_src

*** Visible Bell

Now remove that retarded flash that gets triggered everytime the cursor hits the top or bottom of the document.

#+begin_src emacs-lisp
(setq visible-bell nil)
#+end_src

*** Launch Buffer

Remove all the noise from the scratch buffer that loads when Emacs starts up.

#+begin_src emacs-lisp
(setq inhibit-startup-message t
      inhibit-startup-screen  t
      initial-scratch-message nil)
#+end_src 

*** Column and Line Numbers

Add line numbers to the column for programming related modes.

#+begin_src emacs-lisp
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))
#+end_src

Add column number along with line number to the mode line

#+begin_src emacs-lisp
(column-number-mode)
#+end_src

Override some modes which derive from the above

#+begin_src emacs-lisp
(dolist (mode '(org-mode-hook
                shell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* Keybindings
** General
   
We use general.el for managing our bindings and set =SPC= and =C-SPC= to prefix i.e. leader keys.

#+begin_src emacs-lisp
(use-package general
  :after evil
  :config (general-create-definer np/leader-keys
  :keymaps '(normal insert visual emacs)
  :prefix "SPC"
  :global-prefix "C-SPC")
#+end_src

We define an example binding to open our literate Emacs config file using =SPC e=

#+begin_src emacs-lisp
(np/leader-keys
  "e" '(lambda () (interactive)
    (find-file (expand-file-name "~/.config/emacs/emacs.org")))))
#+end_src

