.config/emacs/emacs.org
** Evil Mode

We use evil mode for a vi-like editing experience in text buffers.

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t
        evil-want-keybinding  nil
        evil-want-C-u-scroll  t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src

*** Evil Collection

We also use the evil-collection package to to integrate vi-like bindings in other modes not particullarly related to text editing.

#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

*** Argument Text Ojects

This adds evil text objects for parameters in C-like languages. Provides nice experience when editing function calls and definitions.

#+begin_src emacs-lisp
(use-package evil-args
  :config
  (define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
  (define-key evil-outer-text-objects-map "a" 'evil-outer-arg)
  (define-key evil-normal-state-map "]a" 'evil-forward-arg)
  (define-key evil-normal-state-map "[a" 'evil-backward-arg))
#+end_src

*** Surround

We also add the evil-surround package to get vim-surround functionality.

#+begin_src emacs-lisp
(use-package evil-surround
  :after evil
  :config
  (global-evil-surround-mode 1))
#+end_src

*** Highlight on yank, delete, et cetera

The evil-googgles package adds visual hints to evil-mode edits

#+begin_src emacs-lisp
(use-package evil-goggles
  :config
  (evil-goggles-mode))
#+end_src

*** Commenting

Emacs's built-in commenting functionallity isn't always up to the mark. This package adds bindings for more syntax-aware commenting and also adds text text objects for comments on which we can perform actions.

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :init
  (setq evilnc-comment-text-object "c")
  (evilnc-default-hotkeys)
  :bind ("M-:" . evilnc-comment-or-uncomment-lines))
#+end_src

** Resize Windows

We create stateful mappings using hydra which basically allows us to add our own custom modes similar to evil modes like =visual=, =insert=, et cetera.

#+begin_src emacs-lisp
(use-package hydra
  :defer t)
#+end_src

As an example we define a hydra which allows us to resize windows panes using pseudo-vim bindings. We also integrate it with which-key.

#+begin_src emacs-lisp
(defhydra np/window-resize-hydra ()
  "Hydra to change window size using vi-like bindings"
  ("h" evil-window-decrease-width)
  ("j" evil-window-increase-height)
  ("k" evil-window-decrease-height)
  ("l" evil-window-increase-width)
  ("q" nil))

(np/leader-keys
  "r" '(np/window-resize-hydra/body :which-key "Resize Windows"))
#+end_src

** Incremental Selection

This allows us to incrementally select parent text objects in the codes AST using =C-==

#+begin_src emacs-lisp
(use-package expand-region
  :bind ("C-=" . er/expand-region))
#+end_src

* Wild Menu
** Ivy

Ivy enhances the default selection menu's capabilities. Additionally we add some vi-like keybindings for consistent experience with evil-mode.

#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
  :map ivy-minibuffer-map
  ("TAB" . ivy-alt-done)
  ("C-l" . ivy-alt-done)
  ("C-j" . ivy-next-line)
  ("C-k" . ivy-previous-line)
  :map ivy-switch-buffer-map
  ("C-k" . ivy-previous-line)
  ("C-l" . ivy-done)
  ("C-d" . ivy-switch-buffer-kill)
  :map ivy-reverse-i-search-map
  ("C-k" . ivy-previous-line)
  ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode))
#+end_src

The ivy-rich package adds some helpful information the selection menu itself, for example the description of functions and variables.

#+begin_src emacs-lisp
(use-package ivy-rich
  :init (ivy-rich-mode))
#+end_src

The ivy-prescient package helps put frequently used completion candidates at the top of the selection menu. We also make it persist across sessions We also make it persist across sessions.

#+begin_src emacs-lisp
(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (prescient-persist-mode)
  (ivy-prescient-mode))
#+end_src

** Counsel

Counsel provides some useful commands through ivy like =counsel-M-x= and =counsel-find-file= which are written to replace the corresponding default functions built into Emacs.

#+begin_src emacs-lisp
(use-package counsel
  :bind
  (:map minibuffer-local-map ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))
#+end_src

* Development
** Projectile

Projectile is a project management package which works well with git based code bases.

#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/dev")
  (setq projectile-project-search-path '("~/dev")))
  (setq projectile-switch-project-action #'projectile-dired))
#+end_src 

Interface with projectile using counsel functions. This has helpgul interfaces for live-grepping using ripgrep and finding files.

#+begin_src emacs-lisp
(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))
#+end_src

** Magit

Git user interface built on Emacs.

#+begin_src emacs-lisp
(use-package magit
  :commands magit-status)
#+end_src

** Snippets

We use the yasnippets package which allows us to create programming snippets like in most editors. 

#+begin_src emacs-lisp
(use-package yasnippet
  :init
  (setq yas-verbosity 2)
  :hook
  (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all))
#+end_src

Along with that we also use yasnippets-snippets which provides an array of commonly used snippets for popular programming languages and frameworks.

#+begin_src emacs-lisp
(use-package yasnippet-snippets
  :after yasnippet)
#+end_src

** Parentheses

Auto insert and delete parentheses in pairs.

#+begin_src emacs-lisp
(use-package smartparens
  :hook
  (org-mode . smartparens-mode)
  (prog-mode . smartparens-mode))
#+end_src

** LSP

Packages for communicating with language servers for various programming languages. The basic lsp-mode package provides sources for completion to other packages like company-mode.

LSP functions are prefixed with =C-l=. We also set up LSP for simple languages like HTML, CSS and the shell.

#+begin_src emacs-lisp
(defun np/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :init (setq lsp-completion-provider :none)
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . np/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-l")
  :config
  (lsp-enable-which-key-integration t))
#+end_src

*** lsp-ui

This package adds helpful UI to lsp-mode like floating windows, virtual text, better menus for code-actions, et cetera.

#+begin_src emacs-lisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
#+end_src

*** lsp-treemacs

Produces almost an AST for the code for in the buffer for easy navigation. Really cool stuff.

#+begin_src emacs-lisp
(use-package lsp-treemacs
    :after lsp)
#+end_src

*** lsp-ivy

Search for workspace symbols using ivy selection menus.

#+begin_src emacs-lisp
(use-package lsp-ivy
    :after lsp)
#+end_src

** Company

company-mode provides completion menus with entries from various sources for different modes.  We set it up to provide completions from the lsp, file paths, et cetera and also integrate it with yasnippets.

#+begin_src emacs-lisp
(use-package company
  :init
  (setq company-backends
   '((company-capf :with company-yasnippet)
     (company-files :with company-yasnippet)))
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
    ("<tab>" . company-complete-selection))
   (:map lsp-mode-map
    ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
#+end_src

Additonally company-box adds helpful icons to the completion items.

#+begin_src emacs-lisp
(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** Code Formatters

Pre-configured formatting for a variety of programming languages.

#+begin_src emacs-lisp
(use-package format-all
  :hook
  (prog-mode . format-all-mode))
#+end_src

** Languages
*** TypeScript and JavaScript

Emacs doesn't have a TypeScript mode so we install the package and also start the langauge server when we enter the mode.

#+begin_src emacs-lisp
(use-package typescript-mode
  :mode ("\\.js\\'" "\\.jsx\\'" "\\.ts\\'" "\\.tsx\\'")
  :hook (typescript-mode . lsp-deferred))
#+end_src

*** Haskell

Haskell mode isn't built into Emacs either.

#+begin_src emacs-lisp
(use-package haskell-mode
  :mode ("\\.hs\\'")
  :hook (haskell-mode . lsp-deferred))
#+end_src

Setup lsp-haskell as well.

#+begin_src emacs-lisp
(use-package lsp-haskell
  :hook (haskell-mode . lsp-deferred))
#+end_src

*** Dart and Flutter

Same drill.

#+begin_src emacs-lisp
(use-package dart-mode
  :hook (dart-mode . flutter-test-mode))
#+end_src

#+begin_src emacs-lisp
(use-package lsp-dart
  :hook (dart-mode . lsp-deferred))
#+end_src

We also add additional packages for flutter development.

#+begin_src emacs-lisp
(use-package flutter
  :after dart-mode
  :bind (:map dart-mode-map
              ("C-M-x" . #'flutter-run-or-hot-reload)))

(use-package flutter-l10n-flycheck
  :after flutter
  :config
  (flutter-l10n-flycheck-setup))
#+end_src

*** C/C++

Setup ccls.

#+begin_src emacs-lisp
(use-package ccls
  :hook
  (c-mode . lsp-deferred)
  (c++-mode . lsp-deferred)
  (objc-mode . lsp-deferred))
#+end_src

*** Python

Install python mode.

#+begin_src emacs-lisp
(use-package python-mode
  :mode ("\\.py\\'")
  :hook (python-mode . lsp-deferred))
#+end_src

Additionally, the pipenv package helps the LSP figure out which python binary to use inside projects that use pipenv to mangage the virtual environment.

#+begin_src emacs-lisp
(use-package pipenv
  :hook (python-mode . pipenv-mode)
  :init
  (setq
   pipenv-projectile-after-switch-function
   #'pipenv-projectile-after-switch-extended))
#+end_src
   
*** Shell

sh-mode comes with Emacs, we just enable flycheck and lsp-mode for it.

#+begin_src emacs-lisp
(use-package sh-mode
  :ensure nil
  :hook
  (sh-mode . lsp-deferred)
  (sh-mode . flycheck-mode))
#+end_src

