.config/emacs/emacs.org
*** HTML and CSS

These modes come built into Emacs too. We just turn on lsp-mode when they start.

#+begin_src emacs-lisp
(use-package html-mode
  :ensure nil
  :hook
  (html-mode . lsp-deferred))

(use-package css-mode
  :ensure nil
  :hook
  (css-mode . lsp-deferred))
#+end_src

* Org Mode
  
Emacs's flagship pacakge. We change some default icons like collapse indicators and list bullets. Additionally, we also set different font sizes for different heading levels.

Since, we are wrapping text in a 100 character wide column in org-mode, we make evil bindings behave visual-line wise for convenient editing.

#+begin_src emacs-lisp
(defun np/org-mode-setup ()
  (evil-local-set-key 'motion "j" 'evil-next-visual-line)
  (evil-local-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-local-set-key 'motion "$" 'evil-end-of-visual-line)
  (evil-local-set-key 'motion "0" 'evil-beginning-of-visual-line)
  (evil-local-set-key 'motion "^" 'evil-first-non-blank-of-visual-line)
  (org-indent-mode)
  (visual-line-mode))

(use-package org
  :init
  (setq org-src-strip-leading-and-trailing-blank-lines t
        org-src-preserve-indentation t)
  :pin org
  :commands (org-capture org-agenda)
  :hook (org-mode . np/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))))
#+end_src

** Bullets

Replace asterisks with cute little bullet icons for org-mode headings.

#+begin_src emacs-lisp
(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t))
#+end_src

** Center org-mode buffers

We center org-mode buffers and limit their width to 100 characters for a better document editing experience.

#+begin_src emacs-lisp
(defun np/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
   visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . np/org-mode-visual-fill))
#+end_src

** Evaluate Code

Run source code blocks for some scripting langauges and print their output within org-mode.
 
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python     . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

** Literate Configuration

Write Emacs configuration in org-mode (this document) and then tangle the elisp source code blocks into init.el.

#+begin_src emacs-lisp
(defun np/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda ()
  (add-hook 'after-save-hook #'np/org-babel-tangle-config)))
#+end_src

** Structured Templates

Quickly insert source code blocks using shortcuts in org-mode.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
    (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("json" . "src json"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))
#+end_src

** Automatically Make TOC

Generate or update table of contents on save.

#+begin_src emacs-lisp
(use-package org-make-toc
  :after org
  :hook (org-mode . org-make-toc-mode))
#+end_src

* RSS Feeds

We use elfeed to view RSS feeds inside Emacs. URLs for feeds that I subscribe to are maintained in the encrypted =~/.config/emacs/elfeed-url.el= file.

#+begin_src emacs-lisp
(use-package elfeed
  :init (setq-default elfeed-search-filter "")
  :commands (elfeed)
  :bind ("C-x w" . elfeed))
  :config
  (load-file "~/.config/emacs/elfeed-urls.el")
#+end_src

* Shell Modes

We use vterm which is a native terminal emulator implemention which makes it faster than Emacs's builtin =term=.

#+begin_src emacs-lisp
(use-package vterm
  :commands vterm
  :config
  (setq vterm-max-scrollback 10000))
#+end_src

multi-vterm allows us to spawn multiple instances of vterm and even manage them project-wise.

#+begin_src emacs-lisp
(use-package multi-vterm
  :after vterm)
#+end_src

* File Management

We use the dired package to manage files and directories.

#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))
#+end_src

We use dired-open so that dired can open various media files in their respective viewers.

#+begin_src emacs-lisp
(use-package dired-open
  :after dired
  :config
  (setq dired-open-extensions '(("png"  . "sxiv")
                                ("jpg"  . "sxiv")
                                ("jpeg" . "sxiv")
                                ("mp4"  . "mpv")
                                ("mkv"  . "mpv"))))
#+end_src

Hide dotfiles and toggle their visibility using dired-hide-dotfiles.

#+begin_src emacs-lisp
(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))
#+end_src

Visit selected directort in current buffer.

#+begin_src emacs-lisp
(use-package dired-single
  :commands (dired dired-jump))
#+end_src

* Miscellaneous
** Auto Rever Buffers

Mostly to resolve stale dired buffers. Auto revert mode looks for changes to files, and updates them for you.

With these settings, dired buffers are also updated. The last setting makes sure that you're not alerted every time this happens. Which is every time you save something.

#+begin_src emacs-lisp
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)
#+end_src

** No Littering

This package makes sure Emacs doesn't pollute directories with swap files (that is what you call them, no?).

#+begin_src emacs-lisp
(use-package no-littering)
#+end_src

Use the auto-save folder for managing auto save, et cetera files. This is not set by the no-littering package so we do it ourselves.

#+begin_src emacs-lisp
(setq auto-save-file-name-transforms
  `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** Helpful

Adds helpful information like documentation, source code et cetera for all the describe- functions -- one's called using =C-h=.

#+begin_src emacs-lisp
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src 
