.config/emacs/init.el

(use-package html-mode
  :ensure nil
  :hook
  (html-mode . lsp-deferred))

(use-package css-mode
  :ensure nil
  :hook
  (css-mode . lsp-deferred))

(defun np/org-mode-setup ()
  (evil-local-set-key 'motion "j" 'evil-next-visual-line)
  (evil-local-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-local-set-key 'motion "$" 'evil-end-of-visual-line)
  (evil-local-set-key 'motion "0" 'evil-beginning-of-visual-line)
  (evil-local-set-key 'motion "^" 'evil-first-non-blank-of-visual-line)
  (org-indent-mode)
  (visual-line-mode))

(use-package org
  :init
  (setq org-src-strip-leading-and-trailing-blank-lines t
        org-src-preserve-indentation t)
  :pin org
  :commands (org-capture org-agenda)
  :hook (org-mode . np/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))))

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t))

(defun np/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
   visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . np/org-mode-visual-fill))

(with-eval-after-load 'org
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python     . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(defun np/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda ()
  (add-hook 'after-save-hook #'np/org-babel-tangle-config)))

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
    (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("json" . "src json"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

(use-package org-make-toc
  :after org
  :hook (org-mode . org-make-toc-mode))

(use-package elfeed
  :init (setq-default elfeed-search-filter "")
  :commands (elfeed)
  :bind ("C-x w" . elfeed))
  :config
  (load-file "~/.config/emacs/elfeed-urls.el")

(use-package vterm
  :commands vterm
  :config
  (setq vterm-max-scrollback 10000))

(use-package multi-vterm
  :after vterm)

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))

(use-package dired-open
  :after dired
  :config
  (setq dired-open-extensions '(("png"  . "sxiv")
                                ("jpg"  . "sxiv")
                                ("jpeg" . "sxiv")
                                ("mp4"  . "mpv")
                                ("mkv"  . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(use-package dired-single
  :commands (dired dired-jump))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

(use-package no-littering)

(setq auto-save-file-name-transforms
  `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
